package smartZ.day7;


/**
 *
 *
 *	小意走在街上 突然服务器发来警报，需要修bug 假设市区是无限大的区域
 *每个街道坐标是（x，y）小意当前在（0,0）办公室在（gx，gy）街道上。
 *小意周围有多个出租车打车点，赶去办公室有两种办法 1是走路 2是走到
 *打车点去打车去公司。每次移动到相邻的街道横向或者纵向走路都会花费 walkTime
 *时间，打车讲花费taxiTime时间。小意需要尽快到公司
 * 现在小意想知道最快的的时间
 *
 *	输入
 *	第一行   周围出租车打车点的个数  1 <= n <= 50
 *	第二行 每个出租车的打车点的横坐标 tx[i] [-10000,10000] 空格分隔
 *	第三行 每个出租车的纵坐标 ty[i] [-10000,10000] 空格分隔
 *	第四行 办公室的坐标 gx,gy -10000 <= gx，gy <= 10000 空格分隔
 *	第五行 为走路的时间walkTime [1,1000] 和 taxiTime [1,1000]
 *
 *	输入样例
 *	2
 *  -2 -2
 *  0  -2
 *  -4 -2
 *  15 3
 *
 *  输出示例
 *  42
 */
public class Main {
}
